"Untitled" = "Nimetön";

"WindowTitle" = "Asenna %@";

"FilesWindowTitle" = "Tiedostot kohteesta %@";

/* Displayed as a tooltip describing a search field */
"FilesSearchTooltip" = "Etsi polun sisältäviä tiedostoja";

/* Utility Menu Items */
"Utilities_Menu" = "Lisäohjelmat";

/* Print */
"DefaultPrintMenuItem" = "Tulosta…";

/* Menu item titles used for the Show/Hide Files function. */
"Show Files" = "Näytä tiedostot";
"Hide Files" = "Kätke tiedostot";

/* Alert panel indicating that the Installer could not find any plugins to load and therefore cannot perform an install */
"NO_SECTIONS_FOUND_ALERT_TITLE" = "Asentaja ei voinut suorittaa asennusta.";
"NO_SECTIONS_FOUND_ALERT_MESSAGE" = "Asentaja ei löydä joitakin asentamiseen tarvittavia resursseja.\n\nTämä on virhe Asentajassa, ei asennettavassa ohjelmassa.\n\nTeknistä tukea löytyy verkosta osoitteesta\n\nhttp://www.apple.com/fi/support/";

/* Button titles */
"CONTINUE" = "Jatka";
"GOBACK" = "Takaisin";
"CHOOSE" = "Valitse";

"CONTINUE_INSTALLING" = "Jatka asennusta";
"CANCEL_INSTALLING" = "Kumoa asennus";

"OpenFailed" = "Avaaminen epäonnistui";
"OpenFailedMsg" = "Tiedostoa \”%@\” ei voitu avata.";

/* Damaged runner error */
"INSTALLER_IS_DAMAGED_TITLE" = "Asentaja on vioittunut.";
"INSTALLER_IS_DAMAGED_MESSAGE" = "Asentaja ei voi avata pakettia. Tiedoston omistajan tai oikeuksien kanssa voi olla ongelma.";

/* Displayed in an alert panel if the user tries to close the package when the package is in its "busy" state */
"PackageBusyTitle" = "Asentaja on varattu.";
"PackageBusyMessage" = "Ikkunaa ei voida sulkea.";

/* Displayed in an alert panel if the user tries to close the package when the package is in its "paused" state */
"PackagePaused" = "Pakettia ei saa sulkea, koska sitä ei ole vielä asennettu kokonaan. Jos suljet paketin nyt, järjestelmä saattaa jäädä epävakaaseen tilaan.";

/* Install failed alert-box titles */
"InstallFailedTitle" = "Asennus epäonnistui.";
"CannotInstallTitle" = "Asennusta ei voida suorittaa loppuun.";

/* Contents for alert box displayed when the user tries to quit the app while the package is installing */
"CantQuit" = "Asentajaa ei voida lopettaa ohjelman asennuksen aikana.";

/* Displayed when an install fails but the package does not require the machine to be rebooted. */
"FailWarning" = "%@ ei ole asennettu oikein.";

/* Displayed when an install fails but the package does not require the machine to be rebooted. */
"NotInstalledYet" = "Kohdetta %@ ei ole vielä asennettu.";

/* Bold title string in Quit sheet */
"InstallQuitTitle" = "Haluatko varmasti lopettaa Asentajan?";

/* Warnings */
"NeedsShutdown" = "Ohjelmiston asentaminen edellyttää tietokoneen sammuttamista. Suorita asennus loppuun osoittamalla Sammuta.";
"NeedsRestart" = "Ohjelmiston asentaminen edellyttää tietokoneen uudelleenkäynnistystä. Suorita asennus loppuun osoittamalla Käynnistä uudelleen.";
"NeedsLogout" = "Ohjelmiston asennus vaatii kaikkien ohjelmien sulkemista ja käyttäjien uloskirjautumista järjestelmästä. Suorita asennus loppuun osoittamalla Kirjaudu ulos.";

/* Displayed if the user tries to quit while a normal install is taking place */
"StopNormalInProgress" = "Haluatko varmasti lopettaa? Asentajan lopettaminen nyt saattaa jättää järjestelmän epävakaaksi.";

/* Button in quit sheet */
"ChangeDisk" = "Käynnistyslevy";

/* Title on the 'Go Back' button */
"GoBack" = "Takaisin";

/* Button/menu item titles meaning 'Yes, I want to quit the application' */
"Quit" = "Lopeta";
"QuitWithEllipsis" = "Lopeta Asentaja…";

/* Button title meaning 'No, I don't want to quit the application' */
"DontQuit" = "Älä lopeta";

/* Button title used to restart the computer */
"Restart" = "Käynnistä";

/* Standard OK button title */
"OK" = "OK";

/* Button title to cancel an action that produced an alert box */
"Cancel" = "Kumoa";

/* Button title for a sheet which will close the installer window */
"Close" = "Sulje";

/* "Show Error" button */
"ShowError" = "Näytä virhe";

/* Error message given when plugin cannot be found. This is mostly an issue for running over a network. */
"CantFindPlugin" = "Liitännäistä %@ ei löytynyt.";

/* Error message given when plugin is found but can't be loaded. This is mostly an issue for running over a network. */
"CantLoadPlugin" = "Liitännäisen %@ polku löytyi, mutta sen nippua ei voida luoda.";

/* Error message given when plugin is loaded but doesn't have its firstPage outlet set. This is mostly a debugging aid. */
"NoFirstPage" = "Liitännäisellä %@ ei ole ensimmäistä sivua.";

/* Alert box title when the user cannot save a file document */
"CantSaveFile" = "Tiedostoa ei voida tallentaa.";

/* Alert box explanatory text displayed when a user cannot save a file document */
"CantSaveFileText" = "Sinulla ei ehkä ole oikeuksia tallentaa dokumenttia tähän paikkaan.";

/* File Listing Controller Strings */
"FILE_LISTING_NOT_AVAIL" = "Tiedostoluettelo ei ole saatavilla.";
"FILE_LISTING_NOT_AVAIL_YET" = "Tiedostoluettelo ei ole vielä saatavilla.";

/* Security Warning Strings */
/* Display this message if the package will be running programs without the user's knowledge. */
"CheckToolAlert" = "Asentajapaketti suorittaa ohjelman määrittääkseen voidaanko ohjelmisto asentaa. Haluatko jatkaa?";

/* Title for the below message */
"CheckToolAlertEnhancedTitle" = "Paketti suorittaa ohjelman, joka määrittelee voidaanko ohjelmisto asentaa.";

/* Displays this message if the package will be running programs contains inside a package */
"CheckToolAlertEnhanced" = "Pidä tietokoneesi suojattuna suorittamalla ja asentamalla ohjelmia vain luotettavasta lähteestä. Jos et ole varma tämän ohjelmiston lähteestä, sulje ohjelma ja asennus osoittamalla Kumoa.";

/* Displayed in Menu Bar in the Spotlight area when running from install media */
"NoSpotlightTooltip" = "Spotlight ei ole käytettävissä, kun asennat tätä ohjelmaa";

/* Install Automation Strings */
"AutomatedInstallFailure" = "Kohdetta %@ ei voida asentaa tälle levylle.";
"AutomatedInstallFailureWithReason" = "Kohdetta %@ ei voida asentaa tälle levylle.  %@";

"AutomatedInstallTargetFreeSpace" = "Kohdelevyllä ei ole riittävästi vapaata tilaa asennusta varten. Sulje asentaja ja tee lisätilaa poistamalla tiedostoja tai ohjelmia. Yritä sen jälkeen asennusta uudelleen.";
"AutomatedInstallTargetMissingTitle" = "Levyä ei löydy polulta %@.";
"AutomatedInstallTargetMissing" = "Varmista, että olet valinnut oikean levyn ja ettei se ole vahingoittunut tai poistettu levyasemasta.";

/* Install Authenticity Strings */
"UNSIGNED_TITLE" = "Ohjelman lähdettä ei voida määrittää.";
"UNSIGNED_DESCRIPTION" = "Pidä tietokoneesi suojattuna asentamalla ohjelmia vain luotettavasta lähteestä.";
"INVALID_SIGNATURE_ERROR_TITLE" = "Asennus kumottiin, koska ohjelman lähdettä ei voitu varmistaa.";
"INVALID_SIGNATURE_ERROR" = "Pidä tietokoneesi suojattuna asentamalla ohjelmia vain luotettavasta lähteestä.";

/* IADataTransferMonitor Strings */
"CALCULATING_TIME_REMAINING" = "Lasketaan…";
"HOURS_AND_MINUTES_REMAINING" = "%d tuntia ja %d minuuttia";
"HOURS_REMAINING" = "%d tuntia";
"HOUR_AND_MINUTES_REMAINING" = "1 tunti ja %d minuuttia";
"HOUR_REMAINING" = "1 tunti";
"MINUTES_REMAINING" = "%d minuuttia";
"MINUTE_REMAINING" = "1 minuutti";
"LESS_THAN_A_MINUTE_REMAINING" = "alle minuutti";
